W8D1/reddit_clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(posts_params)
        @post.sub_id = params[:sub_id]
        if @post.save
---
INSERT INTO "posts" ("title", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "St Louis Style pizza bad"], ["content", "It is bad!"], ["sub_id", 3], ["author_id", 2], ["created_at", "2020-09-14 23:47:41.812217"], ["updated_at", "2020-09-14 23:47:41.812217"]]