W8D1/reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)

    respond_to do |format|
      if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    respond_to do |format|
      if @sub.update(sub_params)
---
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "here's my re-updated description for the new sub title"], ["updated_at", "2020-09-14 21:59:56.541510"], ["id", 1]]

  def destroy
    if @sub.moderator_id == current_user.id
        @sub.destroy
---
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 2]]

    def set_sub
      @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]