W8D1/reddit_clone/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "baba"], ["updated_at", "2020-09-14 20:43:34.898510"], ["id", 2]]
---
    def update
        @user = User.find_by(id: params[:id])
        if logged_in?
            if @user.id == current_user.id
                if @user.update(user_params)