W6D5/cats99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "speckled"], ["description", "  I'm a speckle cat now."], ["updated_at", "2020-09-04 23:32:25.113468"], ["id", 6]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)