W6D3/first_routes/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        # creates user instance not in DB
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Phil"], ["email", "phil@lakers.com"], ["created_at", "2020-09-02 23:43:58.638194"], ["updated_at", "2020-09-02 23:43:58.638194"]]