W7D3/music_app/app/controllers/bands_controller.rb

    def update
        @band = Band.find(params[:id])
        if @band.update(name: band_params[:name])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Thee Beatle's"], ["updated_at", "2020-09-09 23:50:27.052143"], ["id", 1]]

    def destroy
        @band = Band.find(params[:id]).destroy
---
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]