W7D3/music_app/app/controllers/users_controller.rb

    def create
        @user = User.new(users_params)
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"